Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR77 */
#define IFX_ERAY_TXRQ3_TXR77_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR77 */
#define IFX_ERAY_TXRQ3_TXR77_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR77 */
#define IFX_ERAY_TXRQ3_TXR77_OFF (13u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR78 */
#define IFX_ERAY_TXRQ3_TXR78_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR78 */
#define IFX_ERAY_TXRQ3_TXR78_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR78 */
#define IFX_ERAY_TXRQ3_TXR78_OFF (14u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR79 */
#define IFX_ERAY_TXRQ3_TXR79_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR79 */
#define IFX_ERAY_TXRQ3_TXR79_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR79 */
#define IFX_ERAY_TXRQ3_TXR79_OFF (15u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR80 */
#define IFX_ERAY_TXRQ3_TXR80_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR80 */
#define IFX_ERAY_TXRQ3_TXR80_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR80 */
#define IFX_ERAY_TXRQ3_TXR80_OFF (16u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR81 */
#define IFX_ERAY_TXRQ3_TXR81_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR81 */
#define IFX_ERAY_TXRQ3_TXR81_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR81 */
#define IFX_ERAY_TXRQ3_TXR81_OFF (17u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR82 */
#define IFX_ERAY_TXRQ3_TXR82_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR82 */
#define IFX_ERAY_TXRQ3_TXR82_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR82 */
#define IFX_ERAY_TXRQ3_TXR82_OFF (18u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR83 */
#define IFX_ERAY_TXRQ3_TXR83_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR83 */
#define IFX_ERAY_TXRQ3_TXR83_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR83 */
#define IFX_ERAY_TXRQ3_TXR83_OFF (19u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR84 */
#define IFX_ERAY_TXRQ3_TXR84_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR84 */
#define IFX_ERAY_TXRQ3_TXR84_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR84 */
#define IFX_ERAY_TXRQ3_TXR84_OFF (20u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR85 */
#define IFX_ERAY_TXRQ3_TXR85_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR85 */
#define IFX_ERAY_TXRQ3_TXR85_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR85 */
#define IFX_ERAY_TXRQ3_TXR85_OFF (21u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR86 */
#define IFX_ERAY_TXRQ3_TXR86_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR86 */
#define IFX_ERAY_TXRQ3_TXR86_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR86 */
#define IFX_ERAY_TXRQ3_TXR86_OFF (22u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR87 */
#define IFX_ERAY_TXRQ3_TXR87_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR87 */
#define IFX_ERAY_TXRQ3_TXR87_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR87 */
#define IFX_ERAY_TXRQ3_TXR87_OFF (23u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR88 */
#define IFX_ERAY_TXRQ3_TXR88_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR88 */
#define IFX_ERAY_TXRQ3_TXR88_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR88 */
#define IFX_ERAY_TXRQ3_TXR88_OFF (24u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR89 */
#define IFX_ERAY_TXRQ3_TXR89_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR89 */
#define IFX_ERAY_TXRQ3_TXR89_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR89 */
#define IFX_ERAY_TXRQ3_TXR89_OFF (25u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR90 */
#define IFX_ERAY_TXRQ3_TXR90_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR90 */
#define IFX_ERAY_TXRQ3_TXR90_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR90 */
#define IFX_ERAY_TXRQ3_TXR90_OFF (26u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR91 */
#define IFX_ERAY_TXRQ3_TXR91_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR91 */
#define IFX_ERAY_TXRQ3_TXR91_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR91 */
#define IFX_ERAY_TXRQ3_TXR91_OFF (27u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR92 */
#define IFX_ERAY_TXRQ3_TXR92_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR92 */
#define IFX_ERAY_TXRQ3_TXR92_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR92 */
#define IFX_ERAY_TXRQ3_TXR92_OFF (28u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR93 */
#define IFX_ERAY_TXRQ3_TXR93_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR93 */
#define IFX_ERAY_TXRQ3_TXR93_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR93 */
#define IFX_ERAY_TXRQ3_TXR93_OFF (29u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR94 */
#define IFX_ERAY_TXRQ3_TXR94_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR94 */
#define IFX_ERAY_TXRQ3_TXR94_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR94 */
#define IFX_ERAY_TXRQ3_TXR94_OFF (30u)

/** \brief Length for Ifx_ERAY_TXRQ3_Bits.TXR95 */
#define IFX_ERAY_TXRQ3_TXR95_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ3_Bits.TXR95 */
#define IFX_ERAY_TXRQ3_TXR95_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ3_Bits.TXR95 */
#define IFX_ERAY_TXRQ3_TXR95_OFF (31u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR96 */
#define IFX_ERAY_TXRQ4_TXR96_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR96 */
#define IFX_ERAY_TXRQ4_TXR96_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR96 */
#define IFX_ERAY_TXRQ4_TXR96_OFF (0u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR97 */
#define IFX_ERAY_TXRQ4_TXR97_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR97 */
#define IFX_ERAY_TXRQ4_TXR97_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR97 */
#define IFX_ERAY_TXRQ4_TXR97_OFF (1u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR98 */
#define IFX_ERAY_TXRQ4_TXR98_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ4_Bits.TXR98 */
#define IFX_ERAY_TXRQ4_TXR98_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ4_Bits.TXR98 */
#define IFX_ERAY_TXRQ4_TXR98_OFF (2u)

/** \brief Length for Ifx_ERAY_TXRQ4_Bits.TXR99 */
#define IFX_ERAY_TXRQ4_TXR99_LEN (1u)

