Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC7 */
#define IFX_ERAY_MBSC1_MBC7_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC7 */
#define IFX_ERAY_MBSC1_MBC7_OFF (7u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC8 */
#define IFX_ERAY_MBSC1_MBC8_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC8 */
#define IFX_ERAY_MBSC1_MBC8_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC8 */
#define IFX_ERAY_MBSC1_MBC8_OFF (8u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC9 */
#define IFX_ERAY_MBSC1_MBC9_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC9 */
#define IFX_ERAY_MBSC1_MBC9_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC9 */
#define IFX_ERAY_MBSC1_MBC9_OFF (9u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC10 */
#define IFX_ERAY_MBSC1_MBC10_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC10 */
#define IFX_ERAY_MBSC1_MBC10_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC10 */
#define IFX_ERAY_MBSC1_MBC10_OFF (10u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC11 */
#define IFX_ERAY_MBSC1_MBC11_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC11 */
#define IFX_ERAY_MBSC1_MBC11_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC11 */
#define IFX_ERAY_MBSC1_MBC11_OFF (11u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC12 */
#define IFX_ERAY_MBSC1_MBC12_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC12 */
#define IFX_ERAY_MBSC1_MBC12_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC12 */
#define IFX_ERAY_MBSC1_MBC12_OFF (12u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC13 */
#define IFX_ERAY_MBSC1_MBC13_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC13 */
#define IFX_ERAY_MBSC1_MBC13_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC13 */
#define IFX_ERAY_MBSC1_MBC13_OFF (13u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC14 */
#define IFX_ERAY_MBSC1_MBC14_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC14 */
#define IFX_ERAY_MBSC1_MBC14_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC14 */
#define IFX_ERAY_MBSC1_MBC14_OFF (14u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC15 */
#define IFX_ERAY_MBSC1_MBC15_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC15 */
#define IFX_ERAY_MBSC1_MBC15_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC15 */
#define IFX_ERAY_MBSC1_MBC15_OFF (15u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC16 */
#define IFX_ERAY_MBSC1_MBC16_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC16 */
#define IFX_ERAY_MBSC1_MBC16_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC16 */
#define IFX_ERAY_MBSC1_MBC16_OFF (16u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC17 */
#define IFX_ERAY_MBSC1_MBC17_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC17 */
#define IFX_ERAY_MBSC1_MBC17_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC17 */
#define IFX_ERAY_MBSC1_MBC17_OFF (17u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC18 */
#define IFX_ERAY_MBSC1_MBC18_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC18 */
#define IFX_ERAY_MBSC1_MBC18_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC18 */
#define IFX_ERAY_MBSC1_MBC18_OFF (18u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC19 */
#define IFX_ERAY_MBSC1_MBC19_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC19 */
#define IFX_ERAY_MBSC1_MBC19_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC19 */
#define IFX_ERAY_MBSC1_MBC19_OFF (19u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC20 */
#define IFX_ERAY_MBSC1_MBC20_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC20 */
#define IFX_ERAY_MBSC1_MBC20_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC20 */
#define IFX_ERAY_MBSC1_MBC20_OFF (20u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC21 */
#define IFX_ERAY_MBSC1_MBC21_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC21 */
#define IFX_ERAY_MBSC1_MBC21_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC21 */
#define IFX_ERAY_MBSC1_MBC21_OFF (21u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC22 */
#define IFX_ERAY_MBSC1_MBC22_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC22 */
#define IFX_ERAY_MBSC1_MBC22_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC22 */
#define IFX_ERAY_MBSC1_MBC22_OFF (22u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC23 */
#define IFX_ERAY_MBSC1_MBC23_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC23 */
#define IFX_ERAY_MBSC1_MBC23_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC23 */
#define IFX_ERAY_MBSC1_MBC23_OFF (23u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC24 */
#define IFX_ERAY_MBSC1_MBC24_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC24 */
#define IFX_ERAY_MBSC1_MBC24_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC24 */
#define IFX_ERAY_MBSC1_MBC24_OFF (24u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC25 */
#define IFX_ERAY_MBSC1_MBC25_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC25 */
#define IFX_ERAY_MBSC1_MBC25_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC25 */
#define IFX_ERAY_MBSC1_MBC25_OFF (25u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC26 */
#define IFX_ERAY_MBSC1_MBC26_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC26 */
#define IFX_ERAY_MBSC1_MBC26_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC26 */
#define IFX_ERAY_MBSC1_MBC26_OFF (26u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC27 */
#define IFX_ERAY_MBSC1_MBC27_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC27 */
#define IFX_ERAY_MBSC1_MBC27_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC27 */
#define IFX_ERAY_MBSC1_MBC27_OFF (27u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC28 */
#define IFX_ERAY_MBSC1_MBC28_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC28 */
#define IFX_ERAY_MBSC1_MBC28_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC28 */
#define IFX_ERAY_MBSC1_MBC28_OFF (28u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC29 */
#define IFX_ERAY_MBSC1_MBC29_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC29 */
#define IFX_ERAY_MBSC1_MBC29_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC29 */
#define IFX_ERAY_MBSC1_MBC29_OFF (29u)

